# Lab - Interacting with SQL from Python
In this lab, we will find the customers who were active in consecutive months of May and June. Follow the steps to complete the analysis.

In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass

## Create a connection between Python and the Sakila database.

In [2]:
mysql_pw = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://lbadia:'+mysql_pw+'@127.0.0.1:3306/sakila'
engine = create_engine(connection_string)

## Create Python function named rentals_may to connect to the Sakila database and return dataframe storing the data from rental table with information for May 2005.

In [4]:
def rentals_may(engine):
    # import pandas as pd
    query1 = '''select * from rental 
               where month(rental_date) = 05 and year(rental_date) = 2005'''
    data = pd.read_sql_query(query1, engine)
    return data

may_data = rentals_may(engine)

In [5]:
rentals_may(engine).head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

## Create Python function named rentals_june to connect to the Sakila database and return dataframe storing the data from rental table with information for June 2005.

In [6]:
def rentals_june(engine):
    # import pandas as pd
    query2 = '''select * from rental 
               where month(rental_date) = 06 and year(rental_date) = 2005'''
    data = pd.read_sql_query(query2, engine)
    return data

june_data = rentals_june(engine)

In [7]:
rentals_june(engine).head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

## Create a Python function to get the number of rentals for each customer in May given the dataframe provided by the function rentals_may. Hint: Consider making use of pandas groupby() and pandas agg()

In [24]:
def rent_cust_may(m):
    num = m.groupby('customer_id', as_index = False).agg('count')
    num['num_rentals'] = num['rental_id']
    return num[['customer_id', 'num_rentals']]

rent_may_data = rent_cust_may(rentals_may(engine))

In [25]:
rent_cust_may(rentals_may(engine)).head(5)

   customer_id  num_rentals
0            1            2
1            2            1
2            3            2
3            5            3
4            6            3

## Create a Python function to get the number of rentals for each customer in June given the dataframe provided by the function rentals_june.

In [28]:
def rent_cust_june(j):
    num = j.groupby('customer_id', as_index=False).agg('count')
    num['num_rentals'] = num['rental_id']
    return num[['customer_id', 'num_rentals']]

rent_juny_data = rent_cust_may(rentals_june(engine))

In [29]:
rent_cust_may(rentals_june(engine)).head(5)

   customer_id  num_rentals
0            1            7
1            2            1
2            3            4
3            4            6
4            5            5

## Write a Python function named check_rentals that given:

- a dataframe with the number of rentals in May by each customer_id
- a dataframe with the number of rentals in June by each customer_id return a new dataframe with the following columns:
customer_id

Rentals_May

Rental_June

The difference between the previous columns

- Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.

In [31]:
def check_rentals(m, j):
    merged = m.merge(j, on = 'customer_id', how = 'outer')
    merged.rename(columns = {'num_rentals_x': 'Rentals_May',
                             'num_rentals_y': 'Rentals_June'}, inplace = True)
    merged['m_j_diff'] = merged['Rentals_June'] - merged['Rentals_May']
    return merged

In [32]:
check_rentals(rent_may_data, rent_juny_data)

     customer_id  Rentals_May  Rentals_June  m_j_diff
0              1          2.0           7.0       5.0
1              2          1.0           1.0       0.0
2              3          2.0           4.0       2.0
3              5          3.0           5.0       2.0
4              6          3.0           4.0       1.0
..           ...          ...           ...       ...
593          583          NaN           6.0       NaN
594          585          NaN           4.0       NaN
595          591          NaN           3.0       NaN
596          592          NaN           5.0       NaN
597          598          NaN           1.0       NaN

[598 rows x 4 columns]

## Create a Python function that given the dataframe returned by the previous function, returns another dataframe with the customer_id of customers who rented movies in may but didn't rent any movie in June.

## Bonus
The functions created in points 2 and 3, are specific for a month. Can you create generic function which will accept any month as an input and returns the same information for the given month?